phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
/*
 * Phoenix-RTOS
 *
 * STM32N6 DMA driver
 *
 * Copyright 2020-2025 Phoenix Systems
 * Author: Daniel Sawka, Aleksander Kaminski, Jacek Maksymowicz
 *
 * %LICENSE%
 */


#include <errno.h>
#include <sys/interrupt.h>
#include <sys/time.h>
#include <sys/mman.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "../common.h"
#include "../stm32l4-multi.h"
#include "libmulti/libdma.h"

#define DMA_SYSPAGE_MAP_NAME "dmamem"

#define DMA_CTRL_GPDMA1     0
#define DMA_CTRL_HPDMA1     1
#define DMA_NUM_CONTROLLERS 2

#if defined(__CPU_STM32N6)
/* Channels 12..15 are capable of 2D transfers, others can only do linear transfers */
#define DMA_NUM_CHANNELS    16
#define DMA_2D_CAPABLE_MASK ((1 << 16) - (1 << 12))
#elif defined(__CPU_STM32H5)
#define DMA_NUM_CHANNELS    8
#define DMA_2D_CAPABLE_MASK 0
#endif

#if defined(__CPU_STM32N6)
enum dma_reqs {
	dma_req_jpeg_rx = 0,
	dma_req_jpeg_tx = 1,
	dma_req_xspi1 = 2,
	dma_req_xspi2 = 3,
	dma_req_xspi3 = 4,
	dma_req_fmc_txrx = 5,
	dma_req_fmc_bch = 6,
	dma_req_adc1 = 7,
	dma_req_adc2 = 8,
	dma_req_cryp_in = 9,
	dma_req_cryp_out = 10,
	dma_req_saes_out = 11,
	dma_req_saes_in = 12,
	dma_req_hash_in = 13,
	dma_req_tim1_cc1 = 14,
	dma_req_tim1_cc2 = 15,
	dma_req_tim1_cc3 = 16,
	dma_req_tim1_cc4 = 17,
	dma_req_tim1_upd = 18,
	dma_req_tim1_trg = 19,
	dma_req_tim1_com = 20,
	dma_req_tim2_cc1 = 21,
	dma_req_tim2_cc2 = 22,
	dma_req_tim2_cc3 = 23,
	dma_req_tim2_cc4 = 24,
	dma_req_tim2_upd = 25,
	dma_req_tim2_trg = 26,
	dma_req_tim3_cc1 = 27,
	dma_req_tim3_cc2 = 28,
	dma_req_tim3_cc3 = 29,
	dma_req_tim3_cc4 = 30,
	dma_req_tim3_upd = 31,
	dma_req_tim3_trg = 32,
	dma_req_tim4_cc1 = 33,
	dma_req_tim4_cc2 = 34,
	dma_req_tim4_cc3 = 35,
	dma_req_tim4_cc4 = 36,
	dma_req_tim4_upd = 37,
	dma_req_tim4_trg = 38,
	dma_req_tim5_cc1 = 39,
	dma_req_tim5_cc2 = 40,
	dma_req_tim5_cc3 = 41,
	dma_req_tim5_cc4 = 42,
	dma_req_tim5_upd = 43,
	dma_req_tim5_trg = 44,
	dma_req_tim6_upd = 45,
	dma_req_tim7_upd = 46,
	dma_req_tim8_cc1 = 47,
	dma_req_tim8_cc2 = 48,
	dma_req_tim8_cc3 = 49,
	dma_req_tim8_cc4 = 50,
	dma_req_tim8_upd = 51,
	dma_req_tim8_trg = 52,
	dma_req_tim8_com = 53,
	dma_req_tim15_cc1 = 56,
	dma_req_tim15_cc2 = 57,
	dma_req_tim15_upd = 58,
	dma_req_tim15_trg = 59,
	dma_req_tim15_com = 60,
	dma_req_tim16_cc1 = 61,
	dma_req_tim16_upd = 62,
	dma_req_tim16_com = 63,
	dma_req_tim17_cc1 = 64,
	dma_req_tim17_upd = 65,
	dma_req_tim17_com = 66,
	dma_req_tim18_cc1 = 67,
	dma_req_tim18_upd = 68,
	dma_req_tim18_com = 69,
	dma_req_lptim1_ic1 = 70,
	dma_req_lptim1_ic2 = 71,
	dma_req_lptim1_ue = 72,
	dma_req_lptim2_ic1 = 73,
	dma_req_lptim2_ic2 = 74,
	dma_req_lptim2_ue = 75,
	dma_req_lptim3_ic1 = 76,
	dma_req_lptim3_ic2 = 77,
	dma_req_lptim3_ue = 78,
	dma_req_spi1_rx = 79,
	dma_req_spi1_tx = 80,
	dma_req_spi2_rx = 81,
	dma_req_spi2_tx = 82,
	dma_req_spi3_rx = 83,
	dma_req_spi3_tx = 84,
	dma_req_spi4_rx = 85,
	dma_req_spi4_tx = 86,
	dma_req_spi5_rx = 87,
	dma_req_spi5_tx = 88,
	dma_req_spi6_rx = 89,
	dma_req_spi6_tx = 90,
	dma_req_sai1_a = 91,
	dma_req_sai1_b = 92,
	dma_req_sai2_a = 93,
	dma_req_sai2_b = 94,
	dma_req_i2c1_rx = 95,
	dma_req_i2c1_tx = 96,
	dma_req_i2c2_rx = 97,
	dma_req_i2c2_tx = 98,
	dma_req_i2c3_rx = 99,
	dma_req_i2c3_tx = 100,
	dma_req_i2c4_rx = 101,
	dma_req_i2c4_tx = 102,
	dma_req_i3c1_rx = 103,
	dma_req_i3c1_tx = 104,
	dma_req_i3c2_rx = 105,
	dma_req_i3c2_tx = 106,
	dma_req_usart1_rx = 107,
	dma_req_usart1_tx = 108,
	dma_req_usart2_rx = 109,
	dma_req_usart2_tx = 110,
	dma_req_usart3_rx = 111,
	dma_req_usart3_tx = 112,
	dma_req_uart4_rx = 113,
	dma_req_uart4_tx = 114,
	dma_req_uart5_rx = 115,
	dma_req_uart5_tx = 116,
	dma_req_usart6_rx = 117,
	dma_req_usart6_tx = 118,
	dma_req_uart7_rx = 119,
	dma_req_uart7_tx = 120,
	dma_req_uart8_rx = 121,
	dma_req_uart8_tx = 122,
	dma_req_uart9_rx = 123,
	dma_req_uart9_tx = 124,
	dma_req_usart10_rx = 125,
	dma_req_usart10_tx = 126,
	dma_req_lpuart1_rx = 127,
	dma_req_lpuart1_tx = 128,
	dma_req_spdifrx_cs = 129,
	dma_req_spdifrx_dt = 130,
	dma_req_adf1_flt0 = 131,
	dma_req_mdf1_flt0 = 132,
	dma_req_mdf1_flt1 = 133,
	dma_req_mdf1_flt2 = 134,
	dma_req_mdf1_flt3 = 135,
	dma_req_mdf1_flt4 = 136,
	dma_req_mdf1_flt5 = 137,
	dma_req_ucpd1_tx = 138,
	dma_req_ucpd1_rx = 139,
	dma_req_dcmi = 140,
	dma_req_i3c1_tc = 141,
	dma_req_i3c1_rs = 142,
	dma_req_i3c2_tc = 143,
	dma_req_i3c2_rs = 144,
	dma_req_sw_trig = 254,
	dma_req_invalid = 255,
};
#elif defined(__CPU_STM32H5)
enum dma_reqs {
	dma_req_adc1 = 0,
	dma_req_adc2,
	dma_req_dac1_ch1,
	dma_req_dac1_ch2,
	dma_req_tim6_upd,
	dma_req_tim7_upd,
	dma_req_spi1_rx,
	dma_req_spi1_tx,
	dma_req_spi2_rx,
	dma_req_spi2_tx,
	dma_req_spi3_rx,
	dma_req_spi3_tx,
	dma_req_i2c1_rx,
	dma_req_i2c1_tx,
	dma_req_i2c2_rx = 15,
	dma_req_i2c2_tx,
	dma_req_i2c3_rx = 18,
	dma_req_i2c3_tx,
	dma_req_usart1_rx = 21,
	dma_req_usart1_tx,
	dma_req_usart2_rx,
	dma_req_usart2_tx,
	dma_req_usart3_rx,
	dma_req_usart3_tx,
	dma_req_uart4_rx,
	dma_req_uart4_tx,
	dma_req_uart5_rx,
	dma_req_uart5_tx,
	dma_req_usart6_rx,
	dma_req_usart6_tx,
	dma_req_uart7_rx,
	dma_req_uart7_tx,
	dma_req_uart8_rx,
	dma_req_uart8_tx,
	dma_req_uart9_rx,
	dma_req_uart9_tx,
	dma_req_usart10_rx,
	dma_req_usart10_tx,
	dma_req_usart11_rx,
	dma_req_usart11_tx,
	dma_req_uart12_rx,
	dma_req_uart12_tx,
	dma_req_lpuart1_rx,
	dma_req_lpuart1_tx,
	dma_req_spi4_rx,
	dma_req_spi4_tx,
	dma_req_spi5_rx,
	dma_req_spi5_tx,
	dma_req_spi6_rx,
	dma_req_spi6_tx,
	dma_req_sai1_a,
	dma_req_sai1_b,
	dma_req_sai2_a,
	dma_req_sai2_b,
	dma_req_ospi1,
	dma_req_tim1_cc1,
	dma_req_tim1_cc2,
	dma_req_tim1_cc3,
	dma_req_tim1_cc4,
	dma_req_tim1_upd,
	dma_req_tim1_trg,
	dma_req_tim1_com,
	dma_req_tim8_cc1,
	dma_req_tim8_cc2,
	dma_req_tim8_cc3,
	dma_req_tim8_cc4,
	dma_req_tim8_upd,
	dma_req_tim8_trg,
	dma_req_tim8_com,
	dma_req_tim2_cc1,
	dma_req_tim2_cc2,
	dma_req_tim2_cc3,
	dma_req_tim2_cc4,
	dma_req_tim2_upd,
	dma_req_tim3_cc1,
	dma_req_tim3_cc2,
	dma_req_tim3_cc3,
	dma_req_tim3_cc4,
	dma_req_tim3_upd,
	dma_req_tim3_trg,
	dma_req_tim4_cc1,
	dma_req_tim4_cc2,
	dma_req_tim4_cc3,
	dma_req_tim4_cc4,
	dma_req_tim4_upd,
	dma_req_tim5_cc1,
	dma_req_tim5_cc2,
	dma_req_tim5_cc3,
	dma_req_tim5_cc4,
	dma_req_tim5_upd,
	dma_req_tim5_trg,
	dma_req_tim15_cc1,
	dma_req_tim15_upd,
	dma_req_tim15_trg,
	dma_req_tim15_com,
	dma_req_tim16_cc1,
	dma_req_tim16_upd,
	dma_req_tim17_cc1,
	dma_req_tim17_upd,
	dma_req_lptim1_ic1,
	dma_req_lptim1_ic2,
	dma_req_lptim1_ue,
	dma_req_lptim2_ic1,
	dma_req_lptim2_ic2,
	dma_req_lptim2_ue,
	dma_req_dcmi,
	dma_req_aes_out,
	dma_req_aes_in,
	dma_req_hash_in,
	dma_req_ucpd1_rx,
	dma_req_ucpd1_tx,
	dma_req_cordic_read,
	dma_req_cordic_write,
	dma_req_fmac_read,
	dma_req_fmac_write,
	dma_req_saes_out,
	dma_req_saes_in,
	dma_req_i3c1_rx,
	dma_req_i3c1_tx,
	dma_req_i3c1_tc,
	dma_req_i3c1_rs,
	dma_req_i2c4_rx,
	dma_req_i2c4_tx,
	dma_req_lptim3_ic1 = 127,
	dma_req_lptim3_ic2,
	dma_req_lptim3_ue,
	dma_req_lptim5_ic1,
	dma_req_lptim5_ic2,
	dma_req_lptim5_ue,
	dma_req_lptim6_ic1,
	dma_req_lptim6_ic2,
	dma_req_lptim6_ue,
	dma_req_i3c2_rx,
	dma_req_i3c2_tx,
	dma_req_i3c2_tc,
	dma_req_i3c2_rs,
	dma_req_sw_trig = 254,
	dma_req_invalid = 255
};
#endif


enum xpdma_regs {
	xpdma_seccfgr = 0x0,
	xpdma_privcfgr,
	xpdma_rcfglockr,
	xpdma_misr,
	xpdma_smisr,
};


#define CHAN_OFFS(chan) (0x14 + ((chan) * 0x20))
enum xpdma_cx_regs {
	xpdma_cxlbar = 0x0,
	hpdma_cxcidcfgr, /* HPDMA instances only */
	hpdma_cxsemcr,   /* HPDMA instances only */
	xpdma_cxfcr,
	xpdma_cxsr,
	xpdma_cxcr,
	xpdma_cxtr1 = 0x10,
	xpdma_cxtr2,
	xpdma_cxbr1,
	xpdma_cxsar,
	xpdma_cxdar,
	xpdma_cxtr3, /* 2D DMA only */
	xpdma_cxbr2, /* 2D DMA only */
	xpdma_cxllr = 0x1f,
};


/* CxTR1 register is slightly weird - the upper 16 bits mostly refer to the destination and lower 16 bits mostly refer to the source.
 * However, bits 29:26 and 13:10 refer to the transfer as a whole (byte exchange, padding and alignment). */
#define XPDMA_CXTR1_INDIVIDUAL_BITS 0xc3ffUL
#define XPDMA_CXTR1_COMMON_BITS     0x3c003c00UL
#define XPDMA_CXTR1_PAM_MASK        (3 << 11)           /* Mask for padding/alignment mode */
#define XPDMA_CXTR1_PAM_PACK        (2 << 11)           /* Padding/alignment set to FIFO queued packing */
#define XPDMA_CXTR1_SRC_EL_SIZE(x)  (((x) >> 0) & 0x3)  /* Log2 of element size for source */
#define XPDMA_CXTR1_DST_EL_SIZE(x)  (((x) >> 16) & 0x3) /* Log2 of element size for destination */

#define XPDMA_CXTR2_TCEM_BLOCK   (0 << 30) /* Generate TC event on block completion, HT on half block */
#define XPDMA_CXTR2_TCEM_RBLOCK  (1 << 30) /* Generate TC event on repeated block completion, HT on half repeated block */
#define XPDMA_CXTR2_TCEM_EACH_LL (2 << 30) /* Generate TC event on each linked-list item completion, HT on half of each list item */
#define XPDMA_CXTR2_TCEM_LAST_LL (3 << 30) /* Generate TC event on last linked-list item completion, HT on half of last list item */
#define XPDMA_CXTR2_TCEM_MASK    (3 << 30)

#define XPDMA_CXTR2_PF_NORMAL (0 << 12) /* XPDMA_CxBR1.BNDT[15:0] controls block size */
#define XPDMA_CXTR2_PF_CTRL   (1 << 12) /* Peripheral controls block size and can complete transfer early */
#define XPDMA_CXTR2_PER_BURST (0 << 11) /* Hardware requests one burst to be transferred */
#define XPDMA_CXTR2_PER_BLOCK (1 << 11) /* Hardware requests one block to be transferred */
#define XPDMA_CXTR2_PER2MEM   (0 << 10) /* Hardware request signals that data is available from source port */
#define XPDMA_CXTR2_MEM2PER   (1 << 10) /* Hardware request signals that data can be written to destination port */
#define XPDMA_CXTR2_MEM2MEM   (1 << 9)  /* Channel is software requested, ignore hardware requests */

#define XPDMA_TOF      (1 << 14) /* Trigger overflow */
#define XPDMA_SUSPF    (1 << 13) /* Channel suspended */
#define XPDMA_USEF     (1 << 12) /* User setting error */
#define XPDMA_ULEF     (1 << 11) /* Bus error when updating from linked-list */
#define XPDMA_DTEF     (1 << 10) /* Bus error when transferring data */
#define XPDMA_HTF      (1 << 9)  /* Half-transfer complete */
#define XPDMA_TCF      (1 << 8)  /* Transfer complete */
#define XPDMA_ALLFLAGS ((XPDMA_TOF << 1) - XPDMA_TCF)
#define XPDMA_ERRFLAGS (XPDMA_USEF | XPDMA_ULEF | XPDMA_DTEF)
#define XPDMA_IDLEF    (1 << 0) /* Channel idle */

#define XPDMA_CXLLR_UT1 (1 << 31)
#define XPDMA_CXLLR_UT2 (1 << 30)
#define XPDMA_CXLLR_UB1 (1 << 29)
#define XPDMA_CXLLR_USA (1 << 28)
#define XPDMA_CXLLR_UDA (1 << 27)
#define XPDMA_CXLLR_UT3 (1 << 26) /* 2D DMA only */
#define XPDMA_CXLLR_UB2 (1 << 25) /* 2D DMA only */
#define XPDMA_CXLLR_ULL (1 << 16)

#define XPDMA_LISTBUF_SIZE 16 /* Maximum size of linked list in memory in words */


struct libdma_perSetup {
	uint8_t defDMA;                    /* One of DMA_CTRL_* */
	uint8_t requests[dma_mem2per + 1]; /* One of dma_req_* */
	uint8_t portPer;                   /* DMA controller port to use for peripheral communication */
	uint8_t portMem;                   /* DMA controller port to use for memory communication */
	uint8_t valid;
};


struct libdma_per {
	uint8_t dma;                   /* Controller selected for the given peripheral. DMA_NUM_CONTROLLERS signifies slot is not in use. */
	uint8_t chns[dma_mem2per + 1]; /* Channel used for a given direction. Value of DMA_NUM_CHANNELS signifies channel is not in use. */
	uint8_t reqs[dma_mem2per + 1];
	uint8_t portPer;
};


/* Note about DMA bus ports:
 * In GPDMA both ports are AHB, so they are equivalent.
 * In HPDMA port 0 is AXI and port 1 is AHB.
 * Only the AXI port of HPDMA can access TCM memories in the CPU.
 */

