phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
#elif defined(__CPU_STM32H5)
static const struct dma_setup {
	volatile uint32_t *base;
	int pctl;
	bool isHPDMA;
} dma_setup[DMA_NUM_CONTROLLERS] = {
	[DMA_CTRL_GPDMA1] = {
		.base = GPDMA_BASE,
		.pctl = pctl_gpdma1,
		.isHPDMA = false,
	},
	[DMA_CTRL_HPDMA1] = {
		.base = HPDMA_BASE,
		.pctl = pctl_gpdma2,
		.isHPDMA = true,
	},
};
#endif


static struct dma_ctrl {
	struct dma_channel {
		handle_t irqLock;
		handle_t cond;
		handle_t intr;
		libdma_chn_setup_t cx;
		libdma_callback_t *cb;
		void *cb_arg;
		libdma_cacheOp_t cacheOps[MAX_BUFS_PER_TRANSACTION];
		uint8_t priority;
		/* libxpdma_* API functions configure the memory data size and increment at a different point than
		 * older libdma_* functions, so we need to store them in the driver */
		struct {
			uint8_t msize;
			uint8_t minc;
		} oldAPI;
	} chns[DMA_NUM_CHANNELS];
	struct libdma_per pers[DMA_NUM_CHANNELS]; /* Each peripheral takes at least 1 channel, so we can have at most DMA_NUM_CHANNELS peripherals */
	uint32_t chanFree;                        /* Bitmap of free channels */
	handle_t takenLock;
} dma_ctrl[DMA_NUM_CONTROLLERS];

static struct {
	bool initialized;
	libdma_listbufs_t *listbufs;
	void *dmaMemPtr;
	size_t dmaMemSz;
	handle_t dmaAllocMutex;
	void *dmaAllocPtr;
	size_t dmaAllocSz;
} dma_common;


static void libdma_cleanupTransfer(int dma, int chn);


static inline bool libdma_hasChannelFinished(volatile uint32_t *chnBase)
{
	return (chnBase == NULL) || ((*(chnBase + xpdma_cxsr) & XPDMA_IDLEF) != 0);
}


/* Utility function for verifying arguments and getting the DMA channel */
static bool libxpdma_getDmaAndChannel(const struct libdma_per *per, int dir, int *dma_out, int *chn_out)
{
	if (per == NULL) {
		return false;
	}

	if ((dir != dma_per2mem) && (dir != dma_mem2per)) {
		return false;
	}

	*dma_out = per->dma;
	*chn_out = per->chns[dir];

	if (*chn_out == DMA_NUM_CHANNELS) {
		/* Channel for this direction not allocated */
		return false;
	}

	return true;
}


/* Check if a buffer is inside the DMA-capable memory range */
static bool libxpdma_isInsideDMAMemory(const void *addr, size_t sz)
{
	uintptr_t addr_start = (uintptr_t)addr;
	uintptr_t addr_end = (uintptr_t)addr + sz;
	bool lowerBound = addr_start >= (uintptr_t)dma_common.dmaMemPtr;
	bool noOverflow = addr_end >= addr_start;
	bool upperBound = addr_end <= ((uintptr_t)dma_common.dmaMemPtr + dma_common.dmaMemSz);
	return lowerBound && noOverflow && upperBound;
}


static inline bool libdma_irqToChannel(int irq, unsigned int *dma, unsigned int *chn)
{
#if defined(__CPU_STM32N6)
	const int gpdma1_irq_min = gpdma1_ch0_irq, hpdma1_irq_min = hpdma1_ch0_irq;
	const int gpdma1_irq_max = gpdma1_ch15_irq, hpdma1_irq_max = hpdma1_ch15_irq;
#elif defined(__CPU_STM32H5)
	const int gpdma1_irq_min = gpdma1_ch0_irq, hpdma1_irq_min = gpdma1_ch0_irq;
	const int gpdma1_irq_max = gpdma1_ch7_irq, hpdma1_irq_max = gpdma2_ch7_irq;
#endif

	if ((irq >= gpdma1_irq_min) && (irq <= gpdma1_irq_max)) {
		*dma = DMA_CTRL_GPDMA1;
		*chn = irq - gpdma1_irq_min;
		return true;
	}
	else if ((irq >= hpdma1_irq_min) && (irq <= hpdma1_irq_max)) {
		*dma = DMA_CTRL_HPDMA1;
		*chn = irq - hpdma1_irq_min;
		return true;
	}

	return false;
}


static inline int libdma_channelToIRQ(unsigned int dma, unsigned int chn)
{
	if (dma == DMA_CTRL_GPDMA1) {
		return gpdma1_ch0_irq + chn;
	}
	else if (dma == DMA_CTRL_HPDMA1) {
#if defined(__CPU_STM32N6)
		return hpdma1_ch0_irq + chn;
#elif defined(__CPU_STM32H5)
		return gpdma2_ch0_irq + chn;
#endif
	}

	return 0;
}


static inline volatile uint32_t *libdma_channelBase(int dma, unsigned int chn)
{
	return dma_setup[dma].base + CHAN_OFFS(chn);
}


static void libdma_cacheOpMem2Per(const void *addr, size_t sz)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_cleanDCache;
	pctl.opDCache.addr = (void *)addr;
	pctl.opDCache.sz = sz;
	platformctl(&pctl);
}


static void libdma_cacheOpPer2Mem(const void *addr, size_t sz)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_cleanInvalDCache;
	pctl.opDCache.addr = (void *)addr;
	pctl.opDCache.sz = sz;
	platformctl(&pctl);
}


static void libxpdma_performCacheOps(int dma, int chn)
{
	libdma_cacheOp_t *ops = dma_ctrl[dma].chns[chn].cacheOps;
	for (size_t i = 0; i < MAX_BUFS_PER_TRANSACTION; i++) {
		if (ops[i].dirSize < 0) {
			libdma_cacheOpPer2Mem(ops[i].buf, -ops[i].dirSize);
		}
		else if (ops[i].dirSize == 0) {
			break;
		}
		else {
			libdma_cacheOpMem2Per(ops[i].buf, ops[i].dirSize);
		}
	}
}


static int libxpdma_addCacheOp(int dma, int chn, const void *buf, size_t size, int dir)
{
	if (size > INT32_MAX) {
		return -EINVAL;
	}

	libdma_cacheOp_t *ops = dma_ctrl[dma].chns[chn].cacheOps;
	ssize_t dirSize = (dir == dma_per2mem) ? -((ssize_t)size) : size;
	for (size_t i = 0; i < MAX_BUFS_PER_TRANSACTION; i++) {
		if (ops[i].buf == buf && ops[i].dirSize == dirSize) {
			return EOK;
		}

		if (ops[i].dirSize == 0) {
			ops[i].buf = buf;
			ops[i].dirSize = dirSize;
			if ((i + 1) < MAX_BUFS_PER_TRANSACTION) {
				ops[i + 1].dirSize = 0;
			}

			return EOK;
		}
	}

	return -ENOMEM;
}


static void libxpdma_clearCacheOps(int dma, int chn)
{
	dma_ctrl[dma].chns[chn].cacheOps[0].dirSize = 0;
}


static void libdma_setLBAR(int dma, int chn, void *addr)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_dmaLinkBaseAddr;
	pctl.dmaLinkBaseAddr.dev = dma_setup[dma].pctl;
	pctl.dmaLinkBaseAddr.channel = chn;
	pctl.dmaLinkBaseAddr.addr = ((uint32_t)addr) & 0xffff0000;
	platformctl(&pctl);
}


static int libdma_irqHandler(unsigned int n, void *arg)
{
	unsigned int dma, chn;
	if (!libdma_irqToChannel(n, &dma, &chn)) {
		return -1;
	}

	volatile uint32_t *chnBase = libdma_channelBase(dma, chn);
	struct dma_channel *sChn = &dma_ctrl[dma].chns[chn];
	uint32_t flags = *(chnBase + xpdma_cxsr) & XPDMA_ALLFLAGS;
	*(chnBase + xpdma_cxfcr) = flags;
	uint8_t handlerFlags = 0;
	if ((flags & XPDMA_HTF) != 0) {
		handlerFlags |= dma_ht;
	}

	if ((flags & XPDMA_TCF) != 0) {
		handlerFlags |= dma_tc;
	}

	if (sChn->cb != NULL) {
		sChn->cb(sChn->cb_arg, handlerFlags);
	}

	/* Check the channel enabled flag to determine if transfer is finished and needs to be cleaned up.
	 * For infinite transfers we set the controller to report TCF after each linked list element,
	 * so despite reporting TCF the channel enabled flag will stay set.
	 * For single transfers, once the transfer is finished TCF will be raised and channel enabled flag
	 * will be cleared by hardware. */
	if ((*(chnBase + xpdma_cxcr) & 1) == 0) {
		libdma_cleanupTransfer(dma, chn);
	}

	return 1;
}


