phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
	return n_changes;
}


static inline uint32_t *libxpdma_getListbuf(int dma, int chn)
{
	return (*dma_common.listbufs)[dma][chn];
}


static int libxpdma_updateLL(int dma, int chn, libdma_chn_setup_t *setup, ssize_t n_changes, uint32_t changeMask, uint32_t **this_ll, size_t *listbuf_offset)
{
	if (n_changes < 0) {
		return n_changes;
	}

	changeMask |= XPDMA_CXLLR_ULL;
	n_changes++;
	size_t i = *listbuf_offset;
	if ((i + (size_t)n_changes) > XPDMA_LISTBUF_SIZE) {
		return -ENOMEM;
	}

	uint32_t *listbuf = libxpdma_getListbuf(dma, chn);
	**this_ll = changeMask | (((uint32_t)&listbuf[i]) & 0xffff);
	if ((changeMask & XPDMA_CXLLR_UT1) != 0) {
		listbuf[i] = setup->tr1;
		i++;
	}

	if ((changeMask & XPDMA_CXLLR_UB1) != 0) {
		listbuf[i] = setup->br1;
		i++;
	}

	if ((changeMask & XPDMA_CXLLR_USA) != 0) {
		listbuf[i] = setup->sar;
		i++;
	}

	if ((changeMask & XPDMA_CXLLR_UDA) != 0) {
		listbuf[i] = setup->dar;
		i++;
	}

	if ((changeMask & XPDMA_CXLLR_ULL) != 0) {
		/* If this is the last element, CxLLR value of 0 will finish transfer.
		 * Otherwise, this value of 0 will be replaced later. */
		listbuf[i] = 0;
		*this_ll = &listbuf[i];
		i++;
	}

	*listbuf_offset = i;
	return EOK;
}


int libxpdma_configureMemory(const struct libdma_per *per, int dir, int isCircular, const libdma_transfer_buffer_t *buffers, size_t n_buffers)
{
	int dma, chn;
	ssize_t ret;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	if ((buffers == NULL) || (n_buffers == 0)) {
		return -EINVAL;
	}

	libdma_chn_setup_t lastSetup = dma_ctrl[dma].chns[chn].cx;
	lastSetup.tr2 &= ~XPDMA_CXTR2_TCEM_MASK;
	lastSetup.tr2 |= (isCircular != 0) ? XPDMA_CXTR2_TCEM_EACH_LL : XPDMA_CXTR2_TCEM_LAST_LL;

	libxpdma_clearCacheOps(dma, chn);
	uint32_t unused;
	ret = libxpdma_configureBuffer(dma, chn, per, &buffers[0], dir, &lastSetup, &unused);
	if (ret < 0) {
		return ret;
	}

	lastSetup.llr = 0;
	dma_ctrl[dma].chns[chn].cx = lastSetup;

	uint32_t *this_ll = &dma_ctrl[dma].chns[chn].cx.llr;
	size_t listbuf_offset = 0;
	uint32_t changeMask;
	for (size_t i = 1; i < n_buffers; i++) {
		/* Add linked list element */
		ret = libxpdma_configureBuffer(dma, chn, per, &buffers[i], dir, &lastSetup, &changeMask);
		ret = libxpdma_updateLL(dma, chn, &lastSetup, ret, changeMask, &this_ll, &listbuf_offset);
		if (ret < 0) {
			return ret;
		}
	}

	if (isCircular != 0) {
		ret = libxpdma_configureBuffer(dma, chn, per, &buffers[0], dir, &lastSetup, &changeMask);
		ret = libxpdma_updateLL(dma, chn, &lastSetup, ret, changeMask, &this_ll, &listbuf_offset);
		if (n_buffers > 1) {
			/* Loop back to first element in memory */
			*this_ll = dma_ctrl[dma].chns[chn].cx.llr;
		}
		else {
			/* Optimization - if there is only one buffer, we can skip updating LLR -
			 * updating it would only set it to the same value it had before. */
			dma_ctrl[dma].chns[chn].cx.llr &= ~XPDMA_CXLLR_ULL;
		}

		if (ret < 0) {
			return ret;
		}
	}

	return EOK;
}


static int libxpdma_startTransaction(const struct libdma_per *per, int dir, int intrFlags, libdma_callback_t *cb, void *cb_arg)
{
	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dir, &dma, &chn)) {
		return -EINVAL;
	}

	if ((cb != NULL) && (intrFlags == 0)) {
		/* Interrupt callback given but no interrupt condition requested */
		return -EINVAL;
	}

	volatile uint32_t *chn_base = libdma_channelBase(dma, chn);
	/* Channel is currently enabled, cannot reconfigure it now */
	if ((*(chn_base + xpdma_cxcr) & 1) != 0) {
		return -EBUSY;
	}

	libxpdma_performCacheOps(dma, chn);
	struct dma_channel *sChn = &dma_ctrl[dma].chns[chn];
	sChn->cb = cb;
	sChn->cb_arg = cb_arg;

	*(chn_base + xpdma_cxtr1) = dma_ctrl[dma].chns[chn].cx.tr1;
	*(chn_base + xpdma_cxtr2) = dma_ctrl[dma].chns[chn].cx.tr2;
	*(chn_base + xpdma_cxbr1) = dma_ctrl[dma].chns[chn].cx.br1;
	*(chn_base + xpdma_cxsar) = dma_ctrl[dma].chns[chn].cx.sar;
	*(chn_base + xpdma_cxdar) = dma_ctrl[dma].chns[chn].cx.dar;
	*(chn_base + xpdma_cxllr) = dma_ctrl[dma].chns[chn].cx.llr;

	uint32_t v = *(chn_base + xpdma_cxcr);
	v &= ~(0x3 << 22);
	v |= (sChn->priority & 0x3) << 22;
	v &= ~(XPDMA_TCF | XPDMA_HTF);
	v |= ((intrFlags & dma_tc) != 0) ? XPDMA_TCF : 0;
	v |= ((intrFlags & dma_ht) != 0) ? XPDMA_HTF : 0;
	/* Use port 1 to access linked lists (AHB on both HPDMA and GPDMA instances) */
	v |= 1 << 17;
	*(chn_base + xpdma_cxcr) = v;
	dataBarier();
	*(chn_base + xpdma_cxcr) = v | 1;
	dataBarier();
	return EOK;
}


int libxpdma_startTransferWithCallback(const struct libdma_per *per, int dir, int intrFlags, libdma_callback_t *cb, void *cb_arg)
{
	return libxpdma_startTransaction(per, dir, intrFlags, cb, cb_arg);
}


int libxpdma_startTransferWithFlag(const struct libdma_per *per, int dir, volatile int *doneFlag)
{
	*doneFlag = 0;
	return libxpdma_startTransaction(per, dir, dma_tc, libdma_transferOnceCallback, (void *)doneFlag);
}


int libxpdma_startTransferPollingOnly(const struct libdma_per *per, int dir)
{
	return libxpdma_startTransaction(per, dir, 0, NULL, NULL);
}


static int libxpdma_waitForChannelIntr(int dma, int chn, volatile int *doneFlag, time_t timeout, time_t end)
{
	int ret = EOK;
	struct dma_channel *sChn = &dma_ctrl[dma].chns[chn];
	time_t condTimeout = timeout;
	mutexLock(sChn->irqLock);
	while (*doneFlag == 0) {
		condWait(sChn->cond, sChn->irqLock, condTimeout);
		if (timeout != 0) {
			time_t now;
			gettime(&now, NULL);
			if (end <= now) {
				ret = -ETIME;
				break;
			}

			condTimeout = end - now;
		}
	}

	mutexUnlock(sChn->irqLock);

	/* Channel may have been cleaned up by interrupt, in which case this function call won't do anything */
	libdma_cleanupTransfer(dma, chn);
	return ret;
}


int libxpdma_waitForTransaction(const struct libdma_per *per, volatile int *flagMem2Per, volatile int *flagPer2Mem, time_t timeout)
{
	/* Phoenix-RTOS doesn't allow us to wait on two conditionals at the same time, so we do a little trick:
	 * if we are asked to wait on two channels, we wait on the RX channel's conditional and active poll on the TX channel.
	 * For our use cases this will be OK (no wasted time) because TX channel will usually finish before RX channel,
	 * so after RX conditional is signalled we just check the TX channel once and exit. */

	bool doM2P = flagMem2Per != NULL;
	bool doP2M = flagPer2Mem != NULL;

