phoenix-rtos/phoenix-rtos-devices/multi/stm32l4-multi/libmulti/libgpdma.c
	volatile int doneFlag;
	bool doWait = doneFlagPtr == NULL;
	if (doWait) {
		doneFlagPtr = &doneFlag;
	}

	ret = libxpdma_startTransferWithFlag(per, dir, doneFlagPtr);
	if (ret < 0) {
		return ret;
	}

	if (!doWait) {
		return 0;
	}


	if (dir == dma_per2mem) {
		ret = libxpdma_waitForTransaction(per, NULL, &doneFlag, timeout);
	}
	else {
		ret = libxpdma_waitForTransaction(per, &doneFlag, NULL, timeout);
	}

	if (mode == dma_modeNoBlock) {
		if (doneFlag != 0) {
			return len;
		}

		return len - (*(libdma_channelBase(dma, chn) + xpdma_cxbr1) & 0xffff);
	}

	return (ret < 0) ? ret : len;
}


int libdma_transfer(const struct libdma_per *per, void *rxMAddr, const void *txMAddr, size_t len)
{
	int ret;
	int txDma, txChn;
	if (!libxpdma_getDmaAndChannel(per, dma_mem2per, &txDma, &txChn)) {
		return -EINVAL;
	}

	libdma_transfer_buffer_t buf;
	if (txMAddr == NULL) {
		static uint32_t dummy;
		buf.buf = &dummy;
		buf.bufSize = len;
		buf.elSize_log = 0;
		buf.burstSize = 1;
		buf.increment = 0;
		buf.isCached = 0; /* We don't care what is transmitted, so we can skip cache operations */
	}
	else {
		buf.buf = (void *)txMAddr;
		buf.bufSize = len;
		buf.elSize_log = dma_ctrl[txDma].chns[txChn].oldAPI.msize;
		buf.burstSize = 1;
		buf.increment = dma_ctrl[txDma].chns[txChn].oldAPI.minc;
		buf.isCached = libxpdma_isInsideDMAMemory(txMAddr, len) ? 0 : 1;
	}

	ret = libxpdma_configureMemory(per, dma_mem2per, 0, &buf, 1);
	if (ret < 0) {
		return ret;
	}

	volatile int txDoneFlag, rxDoneFlag;
	if (rxMAddr != NULL) {
		ret = libdma_transferInternal(per, dma_per2mem, rxMAddr, len, dma_modeNormal, 0, &rxDoneFlag);
		if (ret < 0) {
			return ret;
		}
	}

	ret = libxpdma_startTransferWithFlag(per, dma_mem2per, &txDoneFlag);
	if (ret < 0) {
		return ret;
	}

	return libxpdma_waitForTransaction(per, &txDoneFlag, (rxMAddr != NULL) ? &rxDoneFlag : NULL, 0);
}


int libdma_tx(const struct libdma_per *per, const void *txMAddr, size_t len, int mode, time_t timeout)
{
	return libdma_transferInternal(per, dma_mem2per, (void *)txMAddr, len, mode, timeout, NULL);
}


int libdma_rx(const struct libdma_per *per, void *rxMAddr, size_t len, int mode, time_t timeout)
{
	return libdma_transferInternal(per, dma_per2mem, rxMAddr, len, mode, timeout, NULL);
}


int libdma_txAsync(const struct libdma_per *per, const void *txMAddr, size_t len, volatile int *doneFlag)
{
	return libdma_transferInternal(per, dma_mem2per, (void *)txMAddr, len, dma_modeNormal, 0, doneFlag);
}


int libdma_rxAsync(const struct libdma_per *per, void *rxMAddr, size_t len, volatile int *doneFlag)
{
	return libdma_transferInternal(per, dma_per2mem, rxMAddr, len, dma_modeNormal, 0, doneFlag);
}


int libdma_infiniteRxAsync(const struct libdma_per *per, void *rxMAddr, size_t len, void fn(void *arg, int type), void *arg)
{
	if ((rxMAddr == NULL) || (len == 0)) {
		return libxpdma_cancelTransfer(per, dma_per2mem);
	}

	int dma, chn;
	if (!libxpdma_getDmaAndChannel(per, dma_per2mem, &dma, &chn)) {
		return -EINVAL;
	}

	libdma_transfer_buffer_t buf = {
		.buf = rxMAddr,
		.bufSize = len,
		.elSize_log = dma_ctrl[dma].chns[chn].oldAPI.msize,
		.burstSize = 1,
		.increment = dma_ctrl[dma].chns[chn].oldAPI.minc,
		.isCached = libxpdma_isInsideDMAMemory(rxMAddr, len) ? 0 : 1,
	};

	int ret = libxpdma_configureMemory(per, dma_per2mem, 1, &buf, 1);
	if (ret < 0) {
		return ret;
	}

	return libxpdma_startTransferWithCallback(per, dma_per2mem, dma_tc | dma_ht, fn, arg);
}


uint16_t libdma_leftToRx(const struct libdma_per *per)
{
	ssize_t ret = libxpdma_bufferRemaining(per, dma_per2mem);
	return (ret < 0) ? 0 : (ret & 0xffff);
}


#if defined(__CPU_STM32N6)
static void libdma_setDmaPermissions(int dev, unsigned int chn)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_dmaPermissions;
	pctl.dmaPermissions.secure = 1;
	pctl.dmaPermissions.privileged = -1;
	pctl.dmaPermissions.lock = 0;
	pctl.dmaPermissions.channel = chn;
	pctl.dmaPermissions.dev = dev;
	(void)platformctl(&pctl);
}
#elif defined(__CPU_STM32H5)
static void libdma_setDmaPermissions(int dev, unsigned int chn)
{
	/* Non-secure, non-privileged by default and we keep it that way */
}
#endif


int libdma_init(void)
{
	if (dma_common.initialized) {
		return EOK;
	}

	int ret;
	ret = libdma_getDmaMemory();
	if (ret < 0) {
		return ret;
	}

	if (dma_common.dmaMemSz < sizeof(*dma_common.listbufs)) {
		return -ENOMEM;
	}

	dma_common.listbufs = dma_common.dmaMemPtr;

	mutexCreate(&dma_common.dmaAllocMutex);
	dma_common.dmaAllocPtr = dma_common.dmaMemPtr + sizeof(*dma_common.listbufs);
	dma_common.dmaAllocSz = dma_common.dmaMemSz - sizeof(*dma_common.listbufs);

	for (size_t dma = 0; dma < DMA_NUM_CONTROLLERS; dma++) {
		devClk(dma_setup[dma].pctl, 1);
		mutexCreate(&dma_ctrl[dma].takenLock);
		for (size_t chn = 0; chn < DMA_NUM_CHANNELS; chn++) {
			libdma_setDmaPermissions(dma_setup[dma].pctl, chn);
			condCreate(&dma_ctrl[dma].chns[chn].cond);
			mutexCreate(&dma_ctrl[dma].chns[chn].irqLock);
			/* Set base address for channel's linked list buffer */
			libdma_setLBAR(dma, chn, libxpdma_getListbuf(dma, chn));
			*(libdma_channelBase(dma, chn) + xpdma_cxcr) = (1 << 1); /* Reset channel */
		}

		for (size_t per = 0; per < (sizeof(dma_ctrl[dma].pers) / sizeof(dma_ctrl[dma].pers[0])); per++) {
			dma_ctrl[dma].pers[per].dma = DMA_NUM_CONTROLLERS;
			dma_ctrl[dma].pers[per].chns[0] = DMA_NUM_CHANNELS;
			dma_ctrl[dma].pers[per].chns[1] = DMA_NUM_CHANNELS;
		}

		dma_ctrl[dma].chanFree = ~0u; /* NOTE: bits after (1 << DMA_NUM_CHANNELS) must always be 1 */
	}

	dma_common.initialized = true;
	return EOK;
}
